; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 149293 2 3 3 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph1 - mode
	infrared2 - mode
	infrared0 - mode
	Star3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument2 infrared2)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
)
(:goal (and
	(have_image Planet4 infrared0)
	(have_image Planet5 thermograph1)
	(have_image Star6 infrared2)
	(have_image Star7 infrared2)
	(have_image Planet8 thermograph1)
	(have_image Star9 thermograph1)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (turn_to satellite0 star9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star9)
   goals met: 0 of 6
4. (turn_to satellite1 groundstation0 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 6
5. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 0 of 6
6. (turn_to satellite0 planet5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet5)
   goals met: 0 of 6
7. (turn_to satellite1 star9 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star9)
   goals met: 0 of 6
8. (turn_to satellite0 groundstation1 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 6
9. (take_image satellite1 star9 instrument3 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 1 of 6
10. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 6
11. (turn_to satellite1 planet4 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet4)
   goals met: 1 of 6
12. (turn_to satellite0 planet5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet5)
   goals met: 1 of 6
13. (take_image satellite0 planet5 instrument1 thermograph1)
   added: (have_image planet5 thermograph1)
   goals met: 2 of 6
14. (take_image satellite1 planet4 instrument3 infrared0)
   added: (have_image planet4 infrared0)
   goals met: 3 of 6
15. (turn_to satellite1 star7 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star7)
   goals met: 3 of 6
16. (turn_to satellite0 planet8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet8)
   goals met: 3 of 6
17. (take_image satellite0 planet8 instrument1 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 4 of 6
18. (take_image satellite1 star7 instrument3 infrared2)
   added: (have_image star7 infrared2)
   goals met: 5 of 6
19. (turn_to satellite1 star6 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star6)
   goals met: 5 of 6
20. (take_image satellite1 star6 instrument3 infrared2)
   added: (have_image star6 infrared2)
   goals met: 6 of 6
